УТ_для_edt/src/DataProcessors/смартКомплектацияНоменклатуры/смартКомплектацияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>смартКомплектацияНоменклатуры</name>
  <comment>#077 380 20.10.2020</comment>
  <attributes>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>СтараяНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказыНаСборку</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ЗаказНаСборку</types>
      </type>
    </attributes>
    <attributes>
      <name>СборкаТоваров</name>
      <type>
        <types>DocumentRef.СборкаТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходныйОрдер</name>
      <type>
        <types>DocumentRef.РасходныйОрдерНаТовары</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходныйОрдер</name>
      <type>
        <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Остатки</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Доступно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КОтгрузке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВРезерве</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ_для_edt/src/AccumulationRegisters/СвободныеОстатки/СвободныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СвободныеОстатки</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВРезервеСоСклада</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВРезервеПодЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВНаличииГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеСоСкладаГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеПодЗаказГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКОтгрузке</name>
  <resources>
    <name>ВРезерве</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собирается</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собрано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКОтгрузкеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКОформлениюГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКСборкеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартСобираетсяГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартСобраноГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ОтправительПолучательТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DefinedType.РаспоряжениеНаОтгрузку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/AccumulationRegisters/ГрафикПоступленияТоваров/ГрафикПоступленияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ГрафикПоступленияТоваров</name>
  <resources>
    <name>КоличествоИзЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПодЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоИзЗаказовСНеподтвержденными</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПодЗаказСНеподтвержденными</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКоличествоИзЗаказовГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКоличествоПодЗаказГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКоличествоИзЗаказовСНеподтвержденнымиГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКоличествоПодЗаказСНеподтвержденнымиГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/AccumulationRegisters/ГрафикОтгрузкиТоваров/ГрафикОтгрузкиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ГрафикОтгрузкиТоваров</name>
  <resources>
    <name>КоличествоИзЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПодЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоНеобеспечено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКоличествоИзЗаказовГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКоличествоПодЗаказГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКоличествоНеобеспеченоГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНомерСтрокиЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/DataProcessors/смартКомплектацияНоменклатуры/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОбъектыНазначения") Тогда
		
		Объект.СсылкаНаОбъект = Параметры.ОбъектыНазначения[0];
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.СтараяНоменклатура) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо указать старую номенклатуру");
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.СсылкаНаОбъект) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо указать новую номенклатуру");
		Возврат;
	КонецЕсли;

	Если Объект.СсылкаНаОбъект = Объект.СтараяНоменклатура Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Новая номенклатура не должна равняться старой");
		Возврат;
	КонецЕсли;
	
	Если Объект.ЗаказыНаСборку.Количество() > 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВопросПередСозданиемДокументовЗавершение", ЭтотОбъект, );
		ТекстВопроса = НСтр("ru = 'Перезаполнить таблицу ""Заказы на сборку""?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
	Иначе	
		ВыполнитьОбработкуСервер();		
	КонецЕсли;

	Если Объект.ЗаказыНаСборку.Количество() > 0 Тогда
		ПечатьСборка(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСборка(Команда)
	
	Если Объект.ЗаказыНаСборку.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не обнаружены данные для печати");
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент = СформироватьТабличныйДокументСборкаСервер();
	
	СинонимМакета = "Сборка товаров";
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("смартСборкаТоваров");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].Экземпляров = 1;
    КоллекцияПечатныхФорм[0].СинонимМакета = СинонимМакета;
	КоллекцияПечатныхФорм[0].ИмяФайлаПечатнойФормы = СинонимМакета;
	
	ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма, СинонимМакета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПриказОбУтверждении(Команда)
	
	Если Объект.ЗаказыНаСборку.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не обнаружены данные для печати");
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент = СформироватьТабличныйДокументПриказОбУтвержденииСервер();
	
	СинонимМакета = "Приказ об утверждении новой номенклатуры";
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("смартПриказОбУтвержденииНовойНоменклатуры");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].Экземпляров = 1;
    КоллекцияПечатныхФорм[0].СинонимМакета = СинонимМакета;
	КоллекцияПечатныхФорм[0].ИмяФайлаПечатнойФормы = СинонимМакета;
	
	ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма, СинонимМакета);
	
КонецПроцедуры


&НаКлиенте
Процедура ВопросПередСозданиемДокументовЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда	
		
		ВыполнитьОбработкуСервер();		
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуСервер()
	
	Объект.ЗаказыНаСборку.Очистить();
	
	Организация = Справочники.смартПредопределенныеЗначения.ОрганизацияДляЗаявкиНаГарантийныйРемонт.Значение;
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	СборкаТоваров 		= Перечисления.ХозяйственныеОперации.СборкаТоваров;
	КВыполнению 		= Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;
	Требуется 			= Перечисления.ВариантыОбеспечения.Требуется;
	ПродажаОблагаетсяНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	РазделенаПоЗаказамИНакладным = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	Отгрузить 			= Перечисления.ВариантыОбеспечения.Отгрузить;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтрокаОстаток Из Объект.Остатки Цикл
		
		Количество = СтрокаОстаток.Доступно;
		Если Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументЗаказ = Документы.ЗаказНаСборку.СоздатьДокумент();
		
		ТекДата = ТекущаяДата();
		
		ДокументЗаказ.Дата 				= ТекДата;
		ДокументЗаказ.Организация 		= Организация;
		ДокументЗаказ.Склад 			= СтрокаОстаток.Склад;
		ДокументЗаказ.Ответственный 	= ТекущийПользователь;
		ДокументЗаказ.Статус 					= КВыполнению;
		ДокументЗаказ.ХозяйственнаяОперация 	= СборкаТоваров;
		ДокументЗаказ.Номенклатура 				= Объект.СсылкаНаОбъект;
		ДокументЗаказ.Количество 				= Количество;
		ДокументЗаказ.КоличествоУпаковок		= Количество;
		ДокументЗаказ.НачалоСборкиРазборки 		= ТекДата;
		ДокументЗаказ.ОкончаниеСборкиРазборки 	= ТекДата;
		ДокументЗаказ.ВариантОбеспечения 		= Требуется;
		ДокументЗаказ.СборкаПодДеятельность 	= ПродажаОблагаетсяНДС;
		ДокументЗаказ.ВариантПриемкиТоваров 	= РазделенаПоЗаказамИНакладным;
				
		ДокументЗаказ.Комментарий = "#Создан автоматически";
		
		НоваяСтрока = ДокументЗаказ.Товары.Добавить();
		НоваяСтрока.ВариантОбеспечения = Отгрузить;
		НоваяСтрока.Количество = Количество;
		НоваяСтрока.КоличествоУпаковок = Количество;
		НоваяСтрока.Номенклатура = Объект.СтараяНоменклатура;
		
		Попытка
			НачатьТранзакцию();
			//Сообщить("1 - " + ПривилегированныйРежим());
			ДокументЗаказ.Записать(РежимЗаписиДокумента.Проведение);
			НоваяСтрока = Объект.ЗаказыНаСборку.Добавить();
			
			ДокументСборкаТоваров = СоздатьДокументСборкаТоваров(ДокументЗаказ.Ссылка);
			
			Если ТипЗнч(ДокументСборкаТоваров) = Тип("ДокументСсылка.СборкаТоваров") 
				И ДокументСборкаТоваров.Проведен Тогда				
				
				//++ #Б1074 смарт: Шляпников 08.10.2024 / Изменение функционала обработки Комплектация номенклатуры (ИТСМ 1525)
				// Для ордерных складов создать приходный и расходный ордера
				//Если СтрокаОстаток.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда
				//	ДокументРасходныйОрдер = СоздатьРасходныйОрдерНаТовары(ДокументЗаказ.Ссылка);					
				//КонецЕсли;
				//
				//Если СтрокаОстаток.Склад.ИспользоватьОрдернуюСхемуПриПоступлении Тогда
				//	ДокументПриходныйОрдер = СоздатьПриходныйОрдерНаТовары(ДокументЗаказ.Ссылка);				
				//КонецЕсли;
				//-- #Б1074 смарт: Шляпников 08.10.2024
				
			КонецЕсли;
			
			НоваяСтрока.Документ = ДокументЗаказ.Ссылка;
			НоваяСтрока.СборкаТоваров = ДокументСборкаТоваров;
			//++ #Б1074 смарт: Шляпников 08.10.2024 / Изменение функционала обработки Комплектация номенклатуры (ИТСМ 1525)
			//НоваяСтрока.РасходныйОрдер = ДокументРасходныйОрдер;
			//НоваяСтрока.ПриходныйОрдер = ДокументПриходныйОрдер;
			//-- #Б1074 смарт: Шляпников 08.10.2024
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			//ДокументЗаказ.Записать(РежимЗаписиДокумента.Запись);
			//СинонимДокумента = ДокументЗаказ.Метаданные().Синоним;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось обработать склад """ + СтрокаОстаток.Склад + """ по причине
			|" + ОписаниеОшибки());
			ОтменитьТранзакцию();
		КонецПопытки;

	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЗаказыНаСборку;
	
КонецПроцедуры

&НаСервере
Функция СоздатьДокументСборкаТоваров(ЗаказНаСборку)
	
	Если НЕ ЗаказНаСборку.Проведен Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументСборка = Документы.СборкаТоваров.СоздатьДокумент();
	
	МассивЗаказов = Новый Массив;
	МассивЗаказов.Добавить(ЗаказНаСборку);

	ДанныеЗаполнения = Новый Структура;
	ПараметрыОткрытия = СозданиеНаОснованииУТВызовСервера.ПараметрыОткрытияФормыНакладнойНаОснованииЗаказа(МассивЗаказов, "СборкаТоваров");
	ДанныеЗаполнения = ПараметрыОткрытия.ПараметрыФормы.Основание;
	
	ДокументСборка.Заполнить(ДанныеЗаполнения);

	ДокументСборка.Дата = ТекущаяДата();
	ДокументСборка.Ответственный = Пользователи.ТекущийПользователь();
	ДокументСборка.Комментарий = ЗаказНаСборку.Комментарий;
	                                  
	Попытка
		//Сообщить("2 - " + ПривилегированныйРежим());
		ДокументСборка.Записать(РежимЗаписиДокумента.Проведение);
		
		//++ #Б1074 смарт: Шляпников 08.10.2024 / Изменение функционала обработки Комплектация номенклатуры (ИТСМ 1525)
		ОтправитьПочтовоеУведомлениеПоЗаказуНаСборку(ЗаказНаСборку);
		//-- #Б1074 смарт: Шляпников 08.10.2024

	Исключение
		СинонимДокумента = ДокументСборка.Метаданные().Синоним;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
		|" + ОписаниеОшибки());
		
		//ДокументСборка.Записать(РежимЗаписиДокумента.Запись);
		
	КонецПопытки;
	
	Возврат ДокументСборка.Ссылка;
	
КонецФункции

&НаСервере
Функция СоздатьРасходныйОрдерНаТовары(ЗаказНаСборку)
	
	СтруктураПараметровСозданияРасходныхОрдеров = СкладыСервер.ПараметрыПереоформленияРасходныхОрдеров();
	СтруктураПараметровСозданияРасходныхОрдеров.ЗонаОтгрузки = Справочники.СкладскиеЯчейки.ПустаяСсылка();
	СтруктураПараметровСозданияРасходныхОрдеров.Склад = ЗаказНаСборку.Склад;
	СтруктураПараметровСозданияРасходныхОрдеров.ЗаданиеНаПеревозку = Неопределено;
	СтруктураПараметровСозданияРасходныхОрдеров.РаспоряженияНаОтгрузку.Добавить(ЗаказНаСборку);
	СтруктураПараметровСозданияРасходныхОрдеров.Получатель = ЗаказНаСборку.Склад; //ЗаказНаСборку.Подразделение;
	
	//Сообщить("3 - " + ПривилегированныйРежим());

	СтруктураВозврат = СкладыСервер.ПереоформитьРасходныеОрдера(СтруктураПараметровСозданияРасходныхОрдеров);
	
	ОформленныеОрдера = СтруктураВозврат.ОформленныеОрдера;
	Для Каждого СтрОрдер Из ОформленныеОрдера Цикл
		
		Если ТипЗнч(СтрОрдер.РасходныйОрдер) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
			НовыйДокумент = СтрОрдер.РасходныйОрдер.ПолучитьОбъект();
			НовыйДокумент.Комментарий 	= ЗаказНаСборку.Комментарий;
			//Если НЕ ПраваПользователяПовтИсп.ВзятиеРасходногоОрдераВРаботу() Тогда
			//	НовыйДокумент.Статус = Перечисления.СтатусыРасходныхОрдеров.Подготовлено;
			//Иначе
				НовыйДокумент.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
			//КонецЕсли;
			НовыйДокумент.Дата 			= ЗаказНаСборку.Дата;
			НовыйДокумент.ДатаОтгрузки 	= ЗаказНаСборку.ОкончаниеСборкиРазборки;
			
			НовыйДокумент.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
			НовыйДокумент.ДополнительныеСвойства.Вставить("смартПроверятьНаличиеРолиВзятиеРасходногоОрдераВРаботу", Ложь);
			
			Для Каждого СтрокаОтгрузить Из НовыйДокумент.ОтгружаемыеТовары Цикл
				СтрокаОтгрузить.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
			КонецЦикла;
			
			Попытка
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
				
				Возврат НовыйДокумент.Ссылка;
			Исключение
				СинонимДокумента = НовыйДокумент.Метаданные().Синоним;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать документ """ + СинонимДокумента + """ для склада " + ЗаказНаСборку.Склад + Символы.ПС + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
		
КонецФункции

&НаСервере
Функция СоздатьПриходныйОрдерНаТовары(ЗаказНаСборку)
	
	ЗакрыватьГрафикПоступления = Истина;
	
	Основание = Новый Структура;
	Основание.Вставить("Распоряжение",               ЗаказНаСборку);
	Основание.Вставить("Отправитель",                ЗаказНаСборку.Склад);
	Основание.Вставить("ЗакрыватьГрафикПоступления", ЗакрыватьГрафикПоступления);
	Основание.Вставить("Склад",                      ЗаказНаСборку.Склад);
	Основание.Вставить("СкладскаяОперация", 		 Перечисления.СкладскиеОперации.ПриемкаСобранныхКомплектов);
	Основание.Вставить("ДатаВходящегоДокумента",     ЗаказНаСборку.Дата);
	Основание.Вставить("НомерВходящегоДокумента",    ЗаказНаСборку.Номер);
	Основание.Вставить("ДатаПоступления",            ЗаказНаСборку.ОкончаниеСборкиРазборки);
	Основание.Вставить("ХозяйственнаяОперация",      Перечисления.ХозяйственныеОперации.СборкаТоваров);
	
	ДокументПриходныйОрдер = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	ДокументПриходныйОрдер.Заполнить(Основание);
	
	// Заполнение количества, т.к. типовой алгоритм заполнения не хочет сделать это сам
	Для Каждого СтрокаТовар Из ДокументПриходныйОрдер.Товары Цикл
		
		Если ЗначениеЗаполнено(СтрокаТовар.Количество) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТовар.Количество = ЗаказНаСборку.Количество;
		СтрокаТовар.КоличествоУпаковок = ЗаказНаСборку.КоличествоУпаковок;

	КонецЦикла;
	ДокументПриходныйОрдер.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят;	
	ДокументПриходныйОрдер.Дата = ЗаказНаСборку.Дата;
	ДокументПриходныйОрдер.Комментарий = ЗаказНаСборку.Комментарий;
	ДокументПриходныйОрдер.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	//Сообщить("4 - " + ПривилегированныйРежим());
	ДокументПриходныйОрдер.Записать(РежимЗаписиДокумента.Проведение);

	Возврат ДокументПриходныйОрдер.Ссылка;
	
КонецФункции

//++ #Б1074 смарт: Шляпников 08.10.2024 / Изменение функционала обработки Комплектация номенклатуры (ИТСМ 1525)
&НаСервере
Процедура ОтправитьПочтовоеУведомлениеПоЗаказуНаСборку(ЗаказНаСборку)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.смартРабочаяПочта КАК АдресПочты
	|ИЗ
	|	Справочник.Склады КАК Склады
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО Склады.ТекущийОтветственный = Пользователи.ФизическоеЛицо
	|ГДЕ
	|	Склады.Ссылка = &Склад
	|	И НЕ Склады.ТекущийОтветственный = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Склад", ЗаказНаСборку.Склад);
	
	АдресЭлектроннойПочтыПолучателя = "";
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		АдресЭлектроннойПочтыПолучателя = Выборка.АдресПочты;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(АдресЭлектроннойПочтыПолучателя) Тогда
		АдресЭлектроннойПочтыПолучателя = смартОбщегоНазначенияСКэш.ПолучитьАдресПользователяДляОповещенияОЗаказеНаСборку();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(АдресЭлектроннойПочтыПолучателя) Тогда
		ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Ошибка,,, 
			СтрШаблон("Не удалось отправить письмо, о выводе номенклатуры из обращения %1 %2 %1 Для заказа %3 не заполнена почта получателя", Символы.ПС, ОписаниеОшибки(), ЗаказНаСборку));
		Возврат;
	КонецЕсли;
	
	// смарт: почта
	ДанныеДляОтправки = Новый Структура("Кому, Копии, Тема, Тело, ТипТекста, Важность",
										 АдресЭлектроннойПочтыПолучателя, 
										 ,
										 "Внимание! Номенклатуры выводится из обращения.",
										 СтрШаблон("Необходимо сформировать ордера по документу: %1 ссылка: %2", ЗаказНаСборку, ПолучитьНавигационнуюСсылку(ЗаказНаСборку)),
										 ТипТекстаПочтовогоСообщения.ПростойТекст,
										 ВажностьИнтернетПочтовогоСообщения.Высокая);
										 
	Попытка
											 
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(), ДанныеДляОтправки); 		
		
	Исключение
		
		ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Ошибка,,, 
			"Не удалось отправить письмо, о выводе номенклатуры из обращения "  + Символы.ПС + ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

#Область Остатки

&НаКлиенте
Процедура ПолучитьОстатки(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.СтараяНоменклатура) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо указать старую номенклатуру");
		Возврат;
	КонецЕсли;
	
	Если Объект.Остатки.Количество() > 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗаполнениемТабличнойЧастиЗавершение", ЭтотОбъект, );
		ТекстВопроса = НСтр("ru = 'Перезаполнить таблицу ""Остатки""?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
	Иначе	
		ЗаполнитьОстаткиНаСервере();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗаполнениемТабличнойЧастиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда	
		
		ЗаполнитьОстаткиНаСервере();		
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткиНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса();
	
	Запрос.УстановитьПараметр("ЕдиницыКоличества", 0);
	Запрос.УстановитьПараметр("П", Объект.СтараяНоменклатура);
	
	УстановитьПривилегированныйРежим(Истина);
	Объект.Остатки.Загрузить(Запрос.Выполнить().Выгрузить());
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЗапроса()
	
	// Из отчета ОстаткиИДоступностьТоваров
	Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Набор.Номенклатура КАК Номенклатура,
	|	Набор.Характеристика КАК Характеристика,
	|	Набор.Склад КАК Склад,
	|	СУММА(Набор.ВНаличии) КАК ВНаличии,
	|	СУММА(Набор.ВРезервеСоСклада) КАК ВРезервеСоСклада,
	|	СУММА(Набор.ВРезервеПодЗаказ) КАК ВРезервеПодЗаказ,
	|	СУММА(Набор.КОтгрузке) КАК КОтгрузке
	|ПОМЕСТИТЬ ВтСвободныеОстатки
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.Номенклатура КАК Номенклатура,
	|		Таблица.Характеристика КАК Характеристика,
	|		Таблица.Склад КАК Склад,
	|		Таблица.ВНаличииОстаток КАК ВНаличии,
	|		Таблица.ВРезервеСоСкладаОстаток КАК ВРезервеСоСклада,
	|		Таблица.ВРезервеПодЗаказОстаток КАК ВРезервеПодЗаказ,
	|		0 КАК КОтгрузке
	|	ИЗ
	|		РегистрНакопления.СвободныеОстатки.Остатки(, Номенклатура В ИЕРАРХИИ (&П)) КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Номенклатура,
	|		Таблица.Характеристика,
	|		Таблица.Склад,
	|		Таблица.КОтгрузкеОстаток,
	|		0,
	|		0,
	|		Таблица.КОтгрузкеОстаток
	|	ИЗ
	|		РегистрНакопления.ТоварыКОтгрузке.Остатки(, Номенклатура В ИЕРАРХИИ (&П)) КАК Таблица) КАК Набор
	|
	|СГРУППИРОВАТЬ ПО
	|	Набор.Номенклатура,
	|	Набор.Характеристика,
	|	Набор.Склад
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Набор.Номенклатура КАК Номенклатура,
	|	Набор.Характеристика КАК Характеристика,
	|	Набор.Склад КАК Склад,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА Набор.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|						И Набор.Номенклатура.ВесИспользовать
	|						И ЕСТЬNULL(Набор.Номенклатура.ЕдиницаИзмерения.Знаменатель, 0) <> 0
	|					ТОГДА ВЫРАЗИТЬ(Набор.Номенклатура.ЕдиницаИзмерения.Числитель / Набор.Номенклатура.ЕдиницаИзмерения.Знаменатель КАК ЧИСЛО(15, 7))
	|				КОГДА Набор.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
	|						И Набор.Номенклатура.ВесИспользовать
	|						И ЕСТЬNULL(Набор.Номенклатура.ЕдиницаИзмерения.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ОбъемЕдиницаИзмерения.Числитель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ОбъемЧислитель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ОбъемЗнаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ВесЗнаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|					ТОГДА ВЫРАЗИТЬ((ВЫРАЗИТЬ((ВЫРАЗИТЬ(Набор.Номенклатура.ЕдиницаИзмерения.Числитель / Набор.Номенклатура.ЕдиницаИзмерения.Знаменатель КАК ЧИСЛО(15, 7))) / (ВЫРАЗИТЬ(Набор.Номенклатура.ОбъемЕдиницаИзмерения.Числитель / Набор.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель КАК ЧИСЛО(15, 7))) КАК ЧИСЛО(15, 7))) / (ВЫРАЗИТЬ(Набор.Номенклатура.ОбъемЧислитель / Набор.Номенклатура.ОбъемЗнаменатель КАК ЧИСЛО(15, 7))) * (Набор.Номенклатура.ВесЧислитель / Набор.Номенклатура.ВесЗнаменатель) * (Набор.Номенклатура.ВесЕдиницаИзмерения.Числитель / Набор.Номенклатура.ВесЕдиницаИзмерения.Знаменатель) КАК ЧИСЛО(15, 7))
	|				КОГДА Набор.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)
	|						И Набор.Номенклатура.ВесИспользовать
	|						И ЕСТЬNULL(Набор.Номенклатура.ЕдиницаИзмерения.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ПлощадьЧислитель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ПлощадьЗнаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ВесЗнаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|					ТОГДА ВЫРАЗИТЬ((ВЫРАЗИТЬ((ВЫРАЗИТЬ(Набор.Номенклатура.ЕдиницаИзмерения.Числитель / Набор.Номенклатура.ЕдиницаИзмерения.Знаменатель КАК ЧИСЛО(15, 7))) / (ВЫРАЗИТЬ(Набор.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель / Набор.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель КАК ЧИСЛО(15, 7))) КАК ЧИСЛО(15, 7))) / (ВЫРАЗИТЬ(Набор.Номенклатура.ПлощадьЧислитель / Набор.Номенклатура.ПлощадьЗнаменатель КАК ЧИСЛО(15, 7))) * (Набор.Номенклатура.ВесЧислитель / Набор.Номенклатура.ВесЗнаменатель) * (Набор.Номенклатура.ВесЕдиницаИзмерения.Числитель / Набор.Номенклатура.ВесЕдиницаИзмерения.Знаменатель) КАК ЧИСЛО(15, 7))
	|				КОГДА Набор.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина)
	|						И Набор.Номенклатура.ВесИспользовать
	|						И ЕСТЬNULL(Набор.Номенклатура.ЕдиницаИзмерения.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ДлинаЕдиницаИзмерения.Числитель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ДлинаЧислитель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ДлинаЗнаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ВесЗнаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|					ТОГДА ВЫРАЗИТЬ((ВЫРАЗИТЬ((ВЫРАЗИТЬ(Набор.Номенклатура.ЕдиницаИзмерения.Числитель / Набор.Номенклатура.ЕдиницаИзмерения.Знаменатель КАК ЧИСЛО(15, 7))) / (ВЫРАЗИТЬ(Набор.Номенклатура.ДлинаЕдиницаИзмерения.Числитель / Набор.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель КАК ЧИСЛО(15, 7))) КАК ЧИСЛО(15, 7))) / (ВЫРАЗИТЬ(Набор.Номенклатура.ДлинаЧислитель / Набор.Номенклатура.ДлинаЗнаменатель КАК ЧИСЛО(15, 7))) * (Набор.Номенклатура.ВесЧислитель / Набор.Номенклатура.ВесЗнаменатель) * (Набор.Номенклатура.ВесЕдиницаИзмерения.Числитель / Набор.Номенклатура.ВесЕдиницаИзмерения.Знаменатель) КАК ЧИСЛО(15, 7))
	|				КОГДА Набор.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|						И ЕСТЬNULL(Набор.Номенклатура.ЕдиницаИзмерения.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|					ТОГДА ВЫРАЗИТЬ(Набор.Номенклатура.ЕдиницаИзмерения.Вес * Набор.Номенклатура.ЕдиницаИзмерения.ВесЕдиницаИзмерения.Числитель / Набор.Номенклатура.ЕдиницаИзмерения.ВесЕдиницаИзмерения.Знаменатель КАК ЧИСЛО(15, 7))
	|				КОГДА (Набор.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	|						ИЛИ Набор.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.ПустаяСсылка)
	|						ИЛИ ЕСТЬNULL(Набор.Номенклатура.ЕдиницаИзмерения.Ссылка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))
	|						И Набор.Номенклатура.ВесИспользовать
	|						И ЕСТЬNULL(Набор.Номенклатура.ВесЗнаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|					ТОГДА ВЫРАЗИТЬ(Набор.Номенклатура.ВесЧислитель / Набор.Номенклатура.ВесЗнаменатель * (Набор.Номенклатура.ВесЕдиницаИзмерения.Числитель / Набор.Номенклатура.ВесЕдиницаИзмерения.Знаменатель) КАК ЧИСЛО(15, 7))
	|				ИНАЧЕ 0
	|			КОНЕЦ / (ВЫРАЗИТЬ(1 КАК ЧИСЛО(15, 7))) КАК ЧИСЛО(15, 7))) КАК Вес,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА Набор.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Объем)
	|						И Набор.Номенклатура.ОбъемИспользовать
	|						И ЕСТЬNULL(Набор.Номенклатура.ЕдиницаИзмерения.Знаменатель, 0) <> 0
	|					ТОГДА ВЫРАЗИТЬ(Набор.Номенклатура.ЕдиницаИзмерения.Числитель / Набор.Номенклатура.ЕдиницаИзмерения.Знаменатель КАК ЧИСЛО(15, 7))
	|				КОГДА Набор.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Вес)
	|						И Набор.Номенклатура.ОбъемИспользовать
	|						И ЕСТЬNULL(Набор.Номенклатура.ЕдиницаИзмерения.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ВесЕдиницаИзмерения.Числитель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ВесЕдиницаИзмерения.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ВесЧислитель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ВесЗнаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ОбъемЗнаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель, 0) <> 0
	|					ТОГДА ВЫРАЗИТЬ((ВЫРАЗИТЬ((ВЫРАЗИТЬ(Набор.Номенклатура.ЕдиницаИзмерения.Числитель / Набор.Номенклатура.ЕдиницаИзмерения.Знаменатель КАК ЧИСЛО(15, 7))) / (ВЫРАЗИТЬ(Набор.Номенклатура.ВесЕдиницаИзмерения.Числитель / Набор.Номенклатура.ВесЕдиницаИзмерения.Знаменатель КАК ЧИСЛО(15, 7))) КАК ЧИСЛО(15, 7))) / (ВЫРАЗИТЬ(Набор.Номенклатура.ВесЧислитель / Набор.Номенклатура.ВесЗнаменатель КАК ЧИСЛО(15, 7))) * (Набор.Номенклатура.ОбъемЧислитель / Набор.Номенклатура.ОбъемЗнаменатель) * (Набор.Номенклатура.ОбъемЕдиницаИзмерения.Числитель / Набор.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель) КАК ЧИСЛО(15, 7))
	|				КОГДА Набор.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Площадь)
	|						И Набор.Номенклатура.ОбъемИспользовать
	|						И ЕСТЬNULL(Набор.Номенклатура.ЕдиницаИзмерения.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ПлощадьЧислитель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ПлощадьЗнаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ОбъемЗнаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель, 0) <> 0
	|					ТОГДА ВЫРАЗИТЬ((ВЫРАЗИТЬ((ВЫРАЗИТЬ(Набор.Номенклатура.ЕдиницаИзмерения.Числитель / Набор.Номенклатура.ЕдиницаИзмерения.Знаменатель КАК ЧИСЛО(15, 7))) / (ВЫРАЗИТЬ(Набор.Номенклатура.ПлощадьЕдиницаИзмерения.Числитель / Набор.Номенклатура.ПлощадьЕдиницаИзмерения.Знаменатель КАК ЧИСЛО(15, 7))) КАК ЧИСЛО(15, 7))) / (ВЫРАЗИТЬ(Набор.Номенклатура.ПлощадьЧислитель / Набор.Номенклатура.ПлощадьЗнаменатель КАК ЧИСЛО(15, 7))) * (Набор.Номенклатура.ОбъемЧислитель / Набор.Номенклатура.ОбъемЗнаменатель) * (Набор.Номенклатура.ОбъемЕдиницаИзмерения.Числитель / Набор.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель) КАК ЧИСЛО(15, 7))
	|				КОГДА Набор.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Длина)
	|						И Набор.Номенклатура.ОбъемИспользовать
	|						И ЕСТЬNULL(Набор.Номенклатура.ЕдиницаИзмерения.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ДлинаЕдиницаИзмерения.Числитель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ДлинаЧислитель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ДлинаЗнаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ОбъемЗнаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель, 0) <> 0
	|					ТОГДА ВЫРАЗИТЬ((ВЫРАЗИТЬ((ВЫРАЗИТЬ(Набор.Номенклатура.ЕдиницаИзмерения.Числитель / Набор.Номенклатура.ЕдиницаИзмерения.Знаменатель КАК ЧИСЛО(15, 7))) / (ВЫРАЗИТЬ(Набор.Номенклатура.ДлинаЕдиницаИзмерения.Числитель / Набор.Номенклатура.ДлинаЕдиницаИзмерения.Знаменатель КАК ЧИСЛО(15, 7))) КАК ЧИСЛО(15, 7))) / (ВЫРАЗИТЬ(Набор.Номенклатура.ДлинаЧислитель / Набор.Номенклатура.ДлинаЗнаменатель КАК ЧИСЛО(15, 7))) * (Набор.Номенклатура.ОбъемЧислитель / Набор.Номенклатура.ОбъемЗнаменатель) * (Набор.Номенклатура.ОбъемЕдиницаИзмерения.Числитель / Набор.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель) КАК ЧИСЛО(15, 7))
	|				КОГДА Набор.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|						И ЕСТЬNULL(Набор.Номенклатура.ЕдиницаИзмерения.ОбъемЕдиницаИзмерения.Знаменатель, 0) <> 0
	|					ТОГДА ВЫРАЗИТЬ(Набор.Номенклатура.ЕдиницаИзмерения.Объем * Набор.Номенклатура.ЕдиницаИзмерения.ОбъемЕдиницаИзмерения.Числитель / Набор.Номенклатура.ЕдиницаИзмерения.ОбъемЕдиницаИзмерения.Знаменатель КАК ЧИСЛО(15, 7))
	|				КОГДА (Набор.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	|						ИЛИ Набор.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.ПустаяСсылка)
	|						ИЛИ ЕСТЬNULL(Набор.Номенклатура.ЕдиницаИзмерения.Ссылка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))
	|						И Набор.Номенклатура.ОбъемИспользовать
	|						И ЕСТЬNULL(Набор.Номенклатура.ОбъемЗнаменатель, 0) <> 0
	|						И ЕСТЬNULL(Набор.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель, 0) <> 0
	|					ТОГДА ВЫРАЗИТЬ(Набор.Номенклатура.ОбъемЧислитель / Набор.Номенклатура.ОбъемЗнаменатель * (Набор.Номенклатура.ОбъемЕдиницаИзмерения.Числитель / Набор.Номенклатура.ОбъемЕдиницаИзмерения.Знаменатель) КАК ЧИСЛО(15, 7))
	|				ИНАЧЕ 0
	|			КОНЕЦ / (ВЫРАЗИТЬ(1 КАК ЧИСЛО(15, 7))) КАК ЧИСЛО(15, 7))) КАК Объем,
	|	МАКСИМУМ(Набор.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаХранения,
	|	МАКСИМУМ(Набор.Номенклатура.ЕдиницаДляОтчетов) КАК ЕдиницаДляОтчетов,
	|	МАКСИМУМ(Набор.Номенклатура.КоэффициентЕдиницыДляОтчетов) КАК КоэффициентЕдиницыДляОтчетов,
	|	СУММА(Набор.ВНаличии) КАК ВНаличии,
	|	СУММА(Набор.ПриходОсновной) КАК ПриходОсновной,
	|	СУММА(Набор.РасходОсновной) КАК РасходОсновной,
	|	СУММА(Набор.ВРезервеСоСкладаИПодЗаказ) КАК ВРезервеСоСкладаИПодЗаказ,
	|	СУММА(Набор.ВРезервеСоСкладаИПодЗаказ) + СУММА(Набор.ВРезервеГрафика) КАК ВРезерве,
	|	СУММА(Набор.КОтгрузке) КАК Котгрузке,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Набор.Номенклатура) КАК НоменклатураПредставление,
	|	Набор.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	Набор.Номенклатура.ЕдиницаДляОтчетов КАК НоменклатураЕдиницаДляОтчетов,
	|	Набор.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|	Набор.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Набор.Склад) КАК СкладПредставление,
	|	Набор.Склад.Наименование КАК СкладНаименование,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Набор.Характеристика) КАК ХарактеристикаПредставление,
	|	Набор.Характеристика.Наименование КАК ХарактеристикаНаименование
	|ПОМЕСТИТЬ ВТ_Основной
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.Номенклатура КАК Номенклатура,
	|		Таблица.Характеристика КАК Характеристика,
	|		Таблица.Склад КАК Склад,
	|		Таблица.ВНаличии КАК ВНаличии,
	|		0 КАК ПриходОсновной,
	|		Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада + Таблица.КОтгрузке КАК РасходОсновной,
	|		Таблица.ВРезервеПодЗаказ + Таблица.ВРезервеСоСклада КАК ВРезервеСоСкладаИПодЗаказ,
	|		0 КАК ВРезервеГрафика,
	|		Таблица.КОтгрузке КАК КОтгрузке
	|	ИЗ
	|		ВтСвободныеОстатки КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Номенклатура,
	|		Таблица.Характеристика,
	|		Таблица.Склад,
	|		0,
	|		Таблица.КоличествоИзЗаказовОстаток,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.ГрафикПоступленияТоваров.Остатки(, Номенклатура В ИЕРАРХИИ (&П)) КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Номенклатура,
	|		Таблица.Характеристика,
	|		Таблица.Склад,
	|		0,
	|		0,
	|		Таблица.КоличествоИзЗаказовОстаток,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.ГрафикОтгрузкиТоваров.Остатки(, Номенклатура В ИЕРАРХИИ (&П)) КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Номенклатура,
	|		Таблица.Характеристика,
	|		Таблица.Склад,
	|		0,
	|		0,
	|		0,
	|		0,
	|		-Таблица.Количество,
	|		0
	|	ИЗ
	|		РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Таблица
	|	ГДЕ
	|		Таблица.Количество < 0
	|		И Таблица.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1)
	|		И Таблица.Номенклатура В ИЕРАРХИИ(&П)) КАК Набор
	|
	|СГРУППИРОВАТЬ ПО
	|	Набор.Номенклатура,
	|	Набор.Характеристика,
	|	Набор.Склад,
	|	Набор.Номенклатура.Артикул,
	|	Набор.Номенклатура.ЕдиницаДляОтчетов,
	|	Набор.Номенклатура.ЕдиницаИзмерения,
	|	Набор.Номенклатура.Наименование,
	|	Набор.Склад.Наименование,
	|	Набор.Характеристика.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Основной.Номенклатура КАК Номенклатура,
	|	ВТ_Основной.Склад КАК Склад,
	|	ВТ_Основной.ВНаличии КАК ВНаличии,
	|	ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0
	|			ТОГДА ВТ_Основной.ВНаличии - ВТ_Основной.ВРезерве - ВТ_Основной.Котгрузке
	|		КОГДА &ЕдиницыКоличества = 1
	|			ТОГДА (ВТ_Основной.ВНаличии - ВТ_Основной.ВРезерве - ВТ_Основной.Котгрузке) / ВТ_Основной.КоэффициентЕдиницыДляОтчетов
	|	КОНЕЦ КАК Доступно,
	|	ВТ_Основной.ВРезерве КАК ВРезерве,
	|	ВТ_Основной.Котгрузке КАК КОтгрузке
	|ИЗ
	|	ВТ_Основной КАК ВТ_Основной
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА &ЕдиницыКоличества = 0
	|						ТОГДА ВТ_Основной.ВНаличии - ВТ_Основной.ВРезерве - ВТ_Основной.Котгрузке
	|					КОГДА &ЕдиницыКоличества = 1
	|						ТОГДА (ВТ_Основной.ВНаличии - ВТ_Основной.ВРезерве - ВТ_Основной.Котгрузке) / ВТ_Основной.КоэффициентЕдиницыДляОтчетов
	|				КОНЕЦ <> 0
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_Основной.ВРезерве <> 0
	|				ТОГДА ИСТИНА
	|			КОГДА ВТ_Основной.Котгрузке <> 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Основной.Склад.Наименование";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область Печать

&НаСервере
Функция СформироватьТабличныйДокументСборкаСервер()
	
	Об = РеквизитФормыВЗначение("Объект");
	Возврат Об.СформироватьТабличныйДокументСборка();

	//
	//// Основной код взят из модуля менеджера документа СборкаТоваров, процедура ПечатьСборкаТоваров. 
	//// Изменения отмечены комментариями от 28.10.2020
	//
	////++ смарт:ММ 28.10.2020
	//МассивОбъектов = Новый Массив;
	//
	//Для Каждого Строка Из Объект.ЗаказыНаСборку Цикл
	//	
	//	Если НЕ ЗначениеЗаполнено(Строка.СборкаТоваров) Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	МассивОбъектов.Добавить(Строка.СборкаТоваров);
	//КонецЦикла;
	////-- смарт:ММ 28.10.2020	
	//
	//ДопКолонка = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	//ВыводитьДопКолонку = ЗначениеЗаполнено(ДопКолонка);
	//
	//ЗапросПоДокументам = Новый Запрос;
	//ЗапросПоДокументам.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	//ЗапросПоДокументам.Текст =
	////++ смарт:ММ 28.10.2020
	////"
	////|ВЫБРАТЬ
	////|	Документ.Ссылка                          КАК Ссылка,
	////|	Документ.Номер                           КАК Номер,
	////|	Документ.Дата                            КАК Дата,
	////|	Документ.Склад                           КАК Склад,
	////|	Документ.Организация                     КАК Организация,
	////|	ПРЕДСТАВЛЕНИЕ(Документ.Склад)            КАК СкладПредставление,
	////|	ПРЕДСТАВЛЕНИЕ(Документ.Организация)      КАК ОрганизацияПредставление,
	////|	Документ.Организация.Префикс             КАК Префикс,
	////|	Документ.Ответственный.ФизическоеЛицо.Наименование КАК ОтветственныйПредставление,
	////|	" + ?(ВыводитьДопКолонку, "Документ.Номенклатура." + ДопКолонка +" КАК ДопКолонка,", "") + "
	////|	Документ.Номенклатура                    КАК Номенклатура,
	////|	Документ.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	////|	Документ.Характеристика.НаименованиеПолное КАК ХарактеристикаПредставление,
	////|
	////|	ВЫБОР КОГДА Документ.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) ТОГДА
	////|			ПРЕДСТАВЛЕНИЕ(Документ.Номенклатура.ЕдиницаИзмерения)
	////|		ИНАЧЕ
	////|			ПРЕДСТАВЛЕНИЕ(Документ.Упаковка)
	////|	КОНЕЦ                                    КАК Упаковка,
	////|	Документ.КоличествоУпаковок              КАК Количество,
	////|	Документ.ХозяйственнаяОперация           КАК ХозяйственнаяОперация,
	////|	Документ.Товары.(
	////|
	////|		НомерСтроки КАК НомерСтроки,
	////|		" + ?(ВыводитьДопКолонку, "Номенклатура." + ДопКолонка +" КАК ДопКолонка,", "") + "
	////|		Номенклатура                        КАК Номенклатура,
	////|		Номенклатура.НаименованиеПолное     КАК НоменклатураПредставление,
	////|		Характеристика.НаименованиеПолное 	КАК ХарактеристикаПредставление,
	////|		Характеристика                      КАК Характеристика,
	////|		ВЫБОР
	////|			КОГДА Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) ТОГДА
	////|				ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.ЕдиницаИзмерения)
	////|			ИНАЧЕ
	////|				ПРЕДСТАВЛЕНИЕССЫЛКИ(Упаковка)
	////|		КОНЕЦ              КАК Упаковка,
	////|		КоличествоУпаковок КАК Количество
	////|
	////|	) КАК ТаблицаТовары
	////|ИЗ
	////|	Документ.СборкаТоваров КАК Документ
	////|
	////|ГДЕ
	////|	Документ.Ссылка В(&МассивОбъектов)
	////|УПОРЯДОЧИТЬ ПО
	////|	Дата, Ссылка, НомерСтроки
	////|";
	//
	//"
	//|ВЫБРАТЬ
	//|	ВТ.СборкаТоваров КАК СборкаТоваров,
	//|	ВТ.НомерСтроки КАК НомерСтроки
	//|ПОМЕСТИТЬ ВТ_ТЧ
	//|ИЗ 
	//|	&ТЧ КАК ВТ
	//|//////////////////////////////////////////////////////////
	//|;
	//|ВЫБРАТЬ
	//|	МИНИМУМ(ВТ.НомерСтроки) КАК НомерСтроки
	//|ПОМЕСТИТЬ ВТ_МинимальныйНомерСтроки
	//|ИЗ 
	//|	ВТ_ТЧ КАК ВТ
	//|ГДЕ
	//|	ВТ.СборкаТоваров <> ЗНАЧЕНИЕ(Документ.СборкаТоваров.ПустаяСсылка)
	//|//////////////////////////////////////////////////////////
	//|;
	//|ВЫБРАТЬ
	//|	ВТ.СборкаТоваров КАК СборкаТоваров
	//|ПОМЕСТИТЬ ВТ_ДокументДляШапки
	//|ИЗ 
	//|	ВТ_ТЧ КАК ВТ
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МинимальныйНомерСтроки КАК ВТ_МинимальныйНомерСтроки
	//|		ПО ВТ.НомерСтроки = ВТ_МинимальныйНомерСтроки.НомерСтроки
	//|//////////////////////////////////////////////////////////
	//|;
	//|ВЫБРАТЬ	
	//|	ТаблицаТовары.Номенклатура                        КАК ТоварыНоменклатура,
	//|	" + ?(ВыводитьДопКолонку, "ТаблицаТовары.Номенклатура." + ДопКолонка +" КАК ТоварыДопКолонка,", "") + "
	//|	ТаблицаТовары.Номенклатура.НаименованиеПолное     КАК ТоварыНоменклатураПредставление,
	//|	ТаблицаТовары.Характеристика.НаименованиеПолное 	КАК ТоварыХарактеристикаПредставление,
	//|	ТаблицаТовары.Характеристика                      КАК ТоварыХарактеристика,
	//|		ВЫБОР
	//|			КОГДА Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) ТОГДА
	//|				ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Номенклатура.ЕдиницаИзмерения)
	//|			ИНАЧЕ
	//|				ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Упаковка)
	//|		КОНЕЦ              КАК ТоварыУпаковка,
	//|	СУММА(ТаблицаТовары.КоличествоУпаковок) КАК ТоварыКоличество
	//|ПОМЕСТИТЬ ВТ_Товары
	//|ИЗ
	//|	Документ.СборкаТоваров.Товары КАК ТаблицаТовары
	//|ГДЕ
	//|	ТаблицаТовары.Ссылка В(&МассивОбъектов)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТаблицаТовары.Номенклатура,
	//|" + ?(ВыводитьДопКолонку, "ТаблицаТовары.Номенклатура." + ДопКолонка + ",", "") + "
	//|	ТаблицаТовары.Номенклатура.НаименованиеПолное,
	//|	ТаблицаТовары.Характеристика.НаименованиеПолное,
	//|	ТаблицаТовары.Характеристика,
	//|	ВЫБОР
	//|		КОГДА Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) ТОГДА
	//|				ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Номенклатура.ЕдиницаИзмерения)
	//|		ИНАЧЕ
	//|				ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Упаковка)
	//|		КОНЕЦ            
	//|
	//|//////////////////////////////////////////////////////////
	//|;
	//|ВЫБРАТЬ
	//|	СУММА(ВТ_Товары.ТоварыКоличество) КАК Количество
	//|ПОМЕСТИТЬ ВТ_ОбщееКоличество
	//|ИЗ 
	//|  ВТ_Товары КАК ВТ_Товары
	//|//////////////////////////////////////////////////////////
	//|;
	//|
	//|ВЫБРАТЬ
	//|	Документ.Ссылка                          КАК Ссылка,
	//|	Документ.Номер                           КАК Номер,
	//|	Документ.Дата                            КАК Дата,
	//|	Документ.Склад                           КАК Склад,
	//|	Документ.Организация                     КАК Организация,
	//|	ПРЕДСТАВЛЕНИЕ(Документ.Склад)            КАК СкладПредставление,
	//|	ПРЕДСТАВЛЕНИЕ(Документ.Организация)      КАК ОрганизацияПредставление,
	//|	Документ.Организация.Префикс             КАК Префикс,
	//|	Документ.Ответственный.ФизическоеЛицо.Наименование КАК ОтветственныйПредставление,
	//|	" + ?(ВыводитьДопКолонку, "Документ.Номенклатура." + ДопКолонка +" КАК ДопКолонка,", "") + "
	//|	Документ.Номенклатура                    КАК Номенклатура,
	//|	Документ.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	//|	Документ.Характеристика.НаименованиеПолное КАК ХарактеристикаПредставление,
	//|
	//|	ВЫБОР КОГДА Документ.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) ТОГДА
	//|			ПРЕДСТАВЛЕНИЕ(Документ.Номенклатура.ЕдиницаИзмерения)
	//|		ИНАЧЕ
	//|			ПРЕДСТАВЛЕНИЕ(Документ.Упаковка)
	//|	КОНЕЦ                                    КАК Упаковка,
	//|	ВТ_ОбщееКоличество.Количество 			КАК Количество,
	//|	Документ.ХозяйственнаяОперация 			КАК ХозяйственнаяОперация,
	////|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	//|	" + ?(ВыводитьДопКолонку, "ТаблицаТовары.ТоварыДопКолонка КАК ТоварыДопКолонка,", "") + "
	//|	ТаблицаТовары.ТоварыНоменклатура КАК ТоварыНоменклатура,
	//|	ТаблицаТовары.ТоварыНоменклатураПредставление КАК ТоварыНоменклатураПредставление,
	//|	ТаблицаТовары.ТоварыХарактеристикаПредставление КАК ТоварыХарактеристикаПредставление,
	//|	ТаблицаТовары.ТоварыХарактеристика КАК ТоварыХарактеристика,
	//|	ТаблицаТовары.ТоварыУпаковка КАК ТоварыУпаковка,
	//|	ТаблицаТовары.ТоварыКоличество КАК ТоварыКоличество
	//|ИЗ
	//|	Документ.СборкаТоваров КАК Документ
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументДляШапки КАК ВТ_ДокументДляШапки
	//|       ПО Документ.Ссылка = ВТ_ДокументДляШапки.СборкаТоваров
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Товары КАК ТаблицаТовары
	//|       ПО ИСТИНА
	//|       ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщееКоличество КАК ВТ_ОбщееКоличество
	//|       ПО ИСТИНА
	//|
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Дата, Ссылка
	//|ИТОГИ 
	//|	МАКСИМУМ(Номер),
	//|	МАКСИМУМ(Дата),
	//|	МАКСИМУМ(Склад),
	//|	МАКСИМУМ(Организация),
	//|	МАКСИМУМ(СкладПредставление),
	//|	МАКСИМУМ(ОрганизацияПредставление),
	//|	МАКСИМУМ(Префикс),
	//|	МАКСИМУМ(ОтветственныйПредставление),
	//|	МАКСИМУМ(ДопКолонка),
	//|	МАКСИМУМ(Номенклатура),
	//|	МАКСИМУМ(НоменклатураПредставление),
	//|	МАКСИМУМ(ХарактеристикаПредставление),
	//|	МАКСИМУМ(Упаковка),
	//|	МАКСИМУМ(Количество),
	//|	МАКСИМУМ(ХозяйственнаяОперация)
	//|ПО
	//|	Ссылка
	//|";
	//ЗапросПоДокументам.УстановитьПараметр("ТЧ", Объект.ЗаказыНаСборку.Выгрузить());
	////-- смарт:ММ 28.10.2020
	//РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс");
	//
	//ТабДокумент = Новый ТабличныйДокумент;
	//ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СборкаТоваров";
	//
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СборкаТоваров.ПФ_MXL_СборкаТоваров");
	//
	//Если ВыводитьДопКолонку Тогда
	//	ОбластьШапки  = "ШапкаСДопКолонкой";
	//	ОбластьСтроки = "СтрокаСДопКолонкой";
	//Иначе
	//	ОбластьШапки  = "ШапкаТаблицы";
	//	ОбластьСтроки = "Строка";
	//КонецЕсли;
	//
	//ПервыйДокумент = Истина;
	////++ смарт:ММ 28.10.2020 
	////ВыборкаДокументы = ЗапросПоДокументам.Выполнить().Выбрать();
	//ВыборкаДокументы = ЗапросПоДокументам.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	////-- смарт:ММ 28.10.2020
	//
	//Пока ВыборкаДокументы.Следующий() Цикл
	//	
	//	НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
	//	
	//	Если Не ПервыйДокумент Тогда
	//		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;
	//	ПервыйДокумент = Ложь;
	//	
	//	// Вывод заголовка.
	//	ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ВыборкаДокументы);
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	//	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента, Строка(ВыборкаДокументы.ХозяйственнаяОперация));
	//	//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
	//	// Фролов+
	//	//ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДокумент, Макет, ОбластьМакета, ВыборкаДокументы.Ссылка);
	//	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДокумент, Макет, ОбластьМакета, 
	//									?(ЗначениеЗаполнено(ВыборкаДокументы.Ссылка.ЗаказНаСборку),ВыборкаДокументы.Ссылка.ЗаказНаСборку,ВыборкаДокументы.Ссылка));
	//	// Фролов-
	//	//-- смарт:ММ 27.03.2020
	//	
	//	ТабДокумент.Вывести(ОбластьМакета);
	//	
	//	// Вывод комплекта.
	//	Если ВыводитьДопКолонку Тогда
	//		
	//		ОбластьМакета = Макет.ПолучитьОбласть("КомплектКод");
	//		ОбластьМакета.Параметры.ДопКолонка = ДопКолонка + ":";
	//		ОбластьМакета.Параметры.ЗначениеДопКолонки = ВыборкаДокументы.ДопКолонка;
	//		ТабДокумент.Вывести(ОбластьМакета);
	//		
	//	КонецЕсли;
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Комплект");
	//	ОбластьМакета.Параметры.Комплект = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
	//		ВыборкаДокументы.НоменклатураПредставление,
	//		ВыборкаДокументы.ХарактеристикаПредставление);
	//	ОбластьМакета.Параметры.Количество = Строка(ВыборкаДокументы.Количество) + " " + ВыборкаДокументы.Упаковка;
	//	ТабДокумент.Вывести(ОбластьМакета);
	//	
	//	// Вывод шапки отчета.
	//	ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
	//	Если ВыводитьДопКолонку Тогда
	//		ОбластьМакета.Параметры.ДопКолонка = ДопКолонка;
	//	КонецЕсли;
	//	ТабДокумент.Вывести(ОбластьМакета);
	//	
	//	// Вывод строк документа.
	//	//++ смарт:ММ 28.10.2020
	//	//ВыборкаПоСтрокам = ВыборкаДокументы.ТаблицаТовары.Выбрать();
	//	ВыборкаПоСтрокам = ВыборкаДокументы.Выбрать();
	//	НомерСтроки = 1;
	//	//-- смарт:ММ 28.10.2020
	//	Пока ВыборкаПоСтрокам.Следующий() Цикл
	//		
	//		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);
	//		ОбластьМакета.Параметры.Заполнить(ВыборкаПоСтрокам);
	//		
	//		//++ смарт:ММ 28.10.2020
	//		//ОбластьМакета.Параметры.НоменклатураПредставление = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
	//		//	ВыборкаПоСтрокам.НоменклатураПредставление,
	//		//	ВыборкаПоСтрокам.ХарактеристикаПредставление);
	//		
	//		ОбластьМакета.Параметры.НоменклатураПредставление = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
	//			ВыборкаПоСтрокам.ТоварыНоменклатураПредставление,
	//			ВыборкаПоСтрокам.ТоварыХарактеристикаПредставление);

	//		ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
	//		ОбластьМакета.Параметры.Количество = ВыборкаПоСтрокам.ТоварыКоличество;
	//		ОбластьМакета.Параметры.Упаковка = ВыборкаПоСтрокам.ТоварыУпаковка;
	//		Если ВыводитьДопКолонку Тогда
	//			ОбластьМакета.Параметры.ДопКолонка = ВыборкаПоСтрокам.ДопКолонка;
	//		КонецЕсли;
	//		НомерСтроки = НомерСтроки + 1;
	//		//-- смарт:ММ 28.10.2020
	//		ТабДокумент.Вывести(ОбластьМакета);
	//		
	//	КонецЦикла;
	//	
	//	// Вывод подписей.
	//	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	//	
	//	//++ смарт:ММ 30.10.2020
	//	//ОбластьМакета.Параметры.ОтветственныйПредставление = "/"+ ВыборкаДокументы.ОтветственныйПредставление + "/";
	//	Если ЗначениеЗаполнено(Объект.МОЛ) Тогда
	//		ФизлицоМОЛ = Объект.МОЛ.ФизическоеЛицо;
	//		Если ЗначениеЗаполнено(ФизлицоМОЛ) Тогда
	//			ОтветственныйПредставление = ФизлицоМОЛ;
	//		Иначе 
	//			ОтветственныйПредставление = Объект.МОЛ;
	//		КонецЕсли;
	//		
	//		ОбластьМакета.Параметры.ОтветственныйПредставление = "/" + ОтветственныйПредставление + "/";
	//	КонецЕсли;
	//	//-- смарт:ММ 30.10.2020
	//	
	//	ТабДокумент.Вывести(ОбластьМакета);
	//	
	//	//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);
	//	
	//КонецЦикла;
	//
	//Возврат ТабДокумент;
	
КонецФункции

&НаКлиенте
Процедура ПечатьДокументов(КоллекцияПечатныхФорм, Знач ОбъектыПечати = Неопределено, ВладелецФормы = Неопределено, ЗаголовокФормы = "")
	
	Если ОбъектыПечати = Неопределено Тогда
		ОбъектыПечати = Новый СписокЗначений;
	КонецЕсли;
	
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	ПараметрыОткрытия.ПараметрыПечати = Новый Структура("ЗаголовокФормы", ЗаголовокФормы);
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	ПараметрыОткрытия.Вставить("ОбъектыПечати", ОбъектыПечати);
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);
	
КонецПроцедуры

&НаСервере
Функция СформироватьТабличныйДокументПриказОбУтвержденииСервер()
	
	Об = РеквизитФормыВЗначение("Объект");
	Возврат Об.СформироватьТабличныйДокументПриказОбУтверждении();
	
КонецФункции

#КонецОбласти
